Revit 2027 API
BuiltInFailures.ConversionFailures.CannotConvertPercentToDouble Property
 Cannot convert concentration percent ' [Percentage Value] ' to double value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConvertPercentToDouble { get; }
Public Shared ReadOnly Property CannotConvertPercentToDouble As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConvertPercentToDouble {
	FailureDefinitionId^ get ();
}
static member CannotConvertPercentToDouble : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace